Model: "CycleGAN"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 512, 512, 1)  0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 512, 512, 1)  0                                            
__________________________________________________________________________________________________
Generator-CT2CB (Model)         (None, 512, 512, 1)  13962727    input_3[0][0]                    
                                                                 Generator-CB2CT[1][0]            
                                                                 input_3[0][0]                    
__________________________________________________________________________________________________
Generator-CB2CT (Model)         (None, 512, 512, 1)  13962727    input_4[0][0]                    
                                                                 Generator-CT2CB[1][0]            
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
Discriminator-CT (Model)        (None, 32, 32, 1)    6957513     Generator-CB2CT[3][0]            
__________________________________________________________________________________________________
Discriminator-CB (Model)        (None, 32, 32, 1)    6957513     Generator-CT2CB[3][0]            
==================================================================================================
Total params: 41,840,480
Trainable params: 27,925,454
Non-trainable params: 13,915,026
__________________________________________________________________________________________________
