Model: "Discriminator-CT"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input (InputLayer)           (None, 512, 512, 1)       0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 256, 256, 64)      1088      
_________________________________________________________________
leaky_re_lu_39 (LeakyReLU)   (None, 256, 256, 64)      0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 128, 128, 128)     131200    
_________________________________________________________________
instance_normalization_47 (I (None, 128, 128, 128)     2         
_________________________________________________________________
leaky_re_lu_40 (LeakyReLU)   (None, 128, 128, 128)     0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 64, 64, 256)       524544    
_________________________________________________________________
instance_normalization_48 (I (None, 64, 64, 256)       2         
_________________________________________________________________
leaky_re_lu_41 (LeakyReLU)   (None, 64, 64, 256)       0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 32, 32, 512)       2097664   
_________________________________________________________________
instance_normalization_49 (I (None, 32, 32, 512)       2         
_________________________________________________________________
leaky_re_lu_42 (LeakyReLU)   (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 32, 32, 512)       4194816   
_________________________________________________________________
instance_normalization_50 (I (None, 32, 32, 512)       2         
_________________________________________________________________
leaky_re_lu_43 (LeakyReLU)   (None, 32, 32, 512)       0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 32, 32, 1)         8193      
=================================================================
Total params: 6,957,513
Trainable params: 6,957,513
Non-trainable params: 0
_________________________________________________________________
