Model: "Generator-CB2CT"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input (InputLayer)              (None, 512, 512, 1)  0                                            
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 512, 512, 32) 544         Input[0][0]                      
__________________________________________________________________________________________________
instance_normalization_55 (Inst (None, 512, 512, 32) 2           conv2d_65[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_49 (LeakyReLU)      (None, 512, 512, 32) 0           instance_normalization_55[0][0]  
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 256, 256, 32) 16416       leaky_re_lu_49[0][0]             
__________________________________________________________________________________________________
instance_normalization_56 (Inst (None, 256, 256, 32) 2           conv2d_66[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_50 (LeakyReLU)      (None, 256, 256, 32) 0           instance_normalization_56[0][0]  
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 256, 256, 64) 32832       leaky_re_lu_50[0][0]             
__________________________________________________________________________________________________
instance_normalization_57 (Inst (None, 256, 256, 64) 2           conv2d_67[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_51 (LeakyReLU)      (None, 256, 256, 64) 0           instance_normalization_57[0][0]  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 128, 128, 64) 65600       leaky_re_lu_51[0][0]             
__________________________________________________________________________________________________
instance_normalization_58 (Inst (None, 128, 128, 64) 2           conv2d_68[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_52 (LeakyReLU)      (None, 128, 128, 64) 0           instance_normalization_58[0][0]  
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 128, 128, 128 131200      leaky_re_lu_52[0][0]             
__________________________________________________________________________________________________
instance_normalization_59 (Inst (None, 128, 128, 128 2           conv2d_69[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_53 (LeakyReLU)      (None, 128, 128, 128 0           instance_normalization_59[0][0]  
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 64, 64, 128)  262272      leaky_re_lu_53[0][0]             
__________________________________________________________________________________________________
instance_normalization_60 (Inst (None, 64, 64, 128)  2           conv2d_70[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_54 (LeakyReLU)      (None, 64, 64, 128)  0           instance_normalization_60[0][0]  
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 64, 64, 256)  524544      leaky_re_lu_54[0][0]             
__________________________________________________________________________________________________
instance_normalization_61 (Inst (None, 64, 64, 256)  2           conv2d_71[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_55 (LeakyReLU)      (None, 64, 64, 256)  0           instance_normalization_61[0][0]  
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 32, 32, 256)  1048832     leaky_re_lu_55[0][0]             
__________________________________________________________________________________________________
instance_normalization_62 (Inst (None, 32, 32, 256)  2           conv2d_72[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_56 (LeakyReLU)      (None, 32, 32, 256)  0           instance_normalization_62[0][0]  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 32, 32, 512)  2097664     leaky_re_lu_56[0][0]             
__________________________________________________________________________________________________
instance_normalization_63 (Inst (None, 32, 32, 512)  2           conv2d_73[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_57 (LeakyReLU)      (None, 32, 32, 512)  0           instance_normalization_63[0][0]  
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 16, 16, 512)  4194816     leaky_re_lu_57[0][0]             
__________________________________________________________________________________________________
instance_normalization_64 (Inst (None, 16, 16, 512)  2           conv2d_74[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_58 (LeakyReLU)      (None, 16, 16, 512)  0           instance_normalization_64[0][0]  
__________________________________________________________________________________________________
up_sampling2d_11 (UpSampling2D) (None, 32, 32, 512)  0           leaky_re_lu_58[0][0]             
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 32, 32, 256)  2097408     up_sampling2d_11[0][0]           
__________________________________________________________________________________________________
instance_normalization_65 (Inst (None, 32, 32, 256)  2           conv2d_75[0][0]                  
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 32, 32, 512)  0           instance_normalization_65[0][0]  
                                                                 leaky_re_lu_56[0][0]             
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 32, 32, 256)  2097408     concatenate_9[0][0]              
__________________________________________________________________________________________________
instance_normalization_66 (Inst (None, 32, 32, 256)  2           conv2d_76[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_59 (LeakyReLU)      (None, 32, 32, 256)  0           instance_normalization_66[0][0]  
__________________________________________________________________________________________________
up_sampling2d_12 (UpSampling2D) (None, 64, 64, 256)  0           leaky_re_lu_59[0][0]             
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 64, 64, 128)  524416      up_sampling2d_12[0][0]           
__________________________________________________________________________________________________
instance_normalization_67 (Inst (None, 64, 64, 128)  2           conv2d_77[0][0]                  
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 64, 64, 256)  0           instance_normalization_67[0][0]  
                                                                 leaky_re_lu_54[0][0]             
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 64, 64, 128)  524416      concatenate_10[0][0]             
__________________________________________________________________________________________________
instance_normalization_68 (Inst (None, 64, 64, 128)  2           conv2d_78[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_60 (LeakyReLU)      (None, 64, 64, 128)  0           instance_normalization_68[0][0]  
__________________________________________________________________________________________________
up_sampling2d_13 (UpSampling2D) (None, 128, 128, 128 0           leaky_re_lu_60[0][0]             
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 128, 128, 64) 131136      up_sampling2d_13[0][0]           
__________________________________________________________________________________________________
instance_normalization_69 (Inst (None, 128, 128, 64) 2           conv2d_79[0][0]                  
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 128, 128, 128 0           instance_normalization_69[0][0]  
                                                                 leaky_re_lu_52[0][0]             
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 128, 128, 64) 131136      concatenate_11[0][0]             
__________________________________________________________________________________________________
instance_normalization_70 (Inst (None, 128, 128, 64) 2           conv2d_80[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_61 (LeakyReLU)      (None, 128, 128, 64) 0           instance_normalization_70[0][0]  
__________________________________________________________________________________________________
up_sampling2d_14 (UpSampling2D) (None, 256, 256, 64) 0           leaky_re_lu_61[0][0]             
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 256, 256, 32) 32800       up_sampling2d_14[0][0]           
__________________________________________________________________________________________________
instance_normalization_71 (Inst (None, 256, 256, 32) 2           conv2d_81[0][0]                  
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 256, 256, 64) 0           instance_normalization_71[0][0]  
                                                                 leaky_re_lu_50[0][0]             
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 256, 256, 32) 32800       concatenate_12[0][0]             
__________________________________________________________________________________________________
instance_normalization_72 (Inst (None, 256, 256, 32) 2           conv2d_82[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_62 (LeakyReLU)      (None, 256, 256, 32) 0           instance_normalization_72[0][0]  
__________________________________________________________________________________________________
up_sampling2d_15 (UpSampling2D) (None, 512, 512, 32) 0           leaky_re_lu_62[0][0]             
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 512, 512, 32) 16416       up_sampling2d_15[0][0]           
__________________________________________________________________________________________________
instance_normalization_73 (Inst (None, 512, 512, 32) 2           conv2d_83[0][0]                  
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 512, 512, 1)  33          instance_normalization_73[0][0]  
==================================================================================================
Total params: 13,962,727
Trainable params: 13,962,727
Non-trainable params: 0
__________________________________________________________________________________________________
